package java1.day09.Ex01;

// 목적 : 
public class Car { // class s
	//1. 필드 : *객체의 데이터를 저장하는 곳!!!!!!!!!
	
	//2. 생성자 : *객체 생성시 초기화 역할 담당
		// *생성자명 : 클래스명과 동일
		// *메소드와 비슷하지만 리턴이 없다. 그러나 인수/매개값은 있다. 
		// *생성자명( 타입명 매개변수, 타입명 매개변수, 타입명 매개변수)
		// *{실행코드}
		// 실행코드 : 1. 매개변수로 전달된 값(실제는 주소값)을 필드에 저장
		//			2. (안전상)필드에 저장하기 전에 가공/유효성 검사를 한다.
		// 필드는 실제 데이터가 저장되는 곳이라서 --> 객체.필드 (권장 X !!)
		// 그래서 캡슐화를 해서 감춰야 한다.
	//1. 기본생성자
	//Car(){}
	//2. 매개변수 3개인 생성자 정의
	Car( String model, String color, int maxSpeed){
		
	}
	//3. 메소드
	
} // class e
