package java1.day08;

public class SportsCar {

}

class Tire{
	
}


/*
	객체와 클래스
		- 객체를 생성할 때에는 설계도(클래스)가 필요하다.
		
		 개발자 -------클래스 생성------> 설계도(클래스)----------> 인스턴스1(객체)
		 									     ----------> 인스턴스2(객체)
												 new 인스턴스화
										붕어빵틀   ----------> 붕어빵1
												 ----------> 붕어빵2
												 	굽기
												 	
		- 클래스의 사용 목적
			1. 객체를 생성하기 위한 설계도 !!
			2. 객체를 만들지 않더라도 실행할 목적으로 많이 쓴다.
			3. ( MVC ) 각 코드 역할 분담 하는 목적으로도 쓰인다.
			
		- 클래스 선언/구성
			- 구성
				1. 어떻게 객체를 생성(생성자) : 객체 생성시 처음/초기값을 필드에 저장 담당하는 메소드
				2. 가져야할 데이터(필드,속성) : 객체의 상태/속성, 주로 변수와 동일하게 생겼다. 하지만 비슷하기 다름
				3. 객체의 행동(메소드)    	: 객체의 행동/이벤트 
												
		- 객체 선언
			클래스명 변수명 = new 생성자();
			Scanner scanner = new scanner( system.in );
*/